Repository: YouROK/torrstv
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Add
ru: Добавить

# magnetLabel
source: Magnet:
ru: Магнет:

source: No file selected
ru: Файл не выбран

source: Select .torrent file
ru: Выбрать .torrent файл

source: Clear selected file
ru: Очистить выбранный файл

source: Saving...
ru: Сохранение...

source: Title of torrent
ru: Название торрента

source: Enter a title
ru: Введите название

# posterUrlLabel
source: Poster URL
ru: URL постера

# categoryLabel
source: Category
ru: Категория

# postersLabel
source: Posters:
ru: Постеры:

# enterMagnetOrFile
source: Please enter a magnet link or select a torrent file
ru: Пожалуйста, введите магнет-ссылку или выберите торрент-файл

source: Torrent added successfully
ru: Торрент успешно добавлен

source: Error adding torrent
ru: Ошибка при добавлении торрента

# errorPrefix
source: Error:
ru: Ошибка:

# moviesCategory
source: Movies
ru: Фильмы

# seriesCategory
source: Series
ru: Сериалы

# musicCategory
source: Music
ru: Музыка

# otherCategory
source: Other
ru: Другое

# donateTitle
source: Please Donate
ru: Пожертвовать

source: Support Development!
ru: Поддержите разработку!

# supportDescription
source: Your support helps cover server costs, development tools, and motivates continuous updates and improvements
ru: Ваша поддержка помогает покрывать расходы на серверы, инструменты для разработки и стимулирует постоянные обновления и улучшения

source: Torrents
ru: Торренты

source: Search
ru: Поиск

source: Donate
ru: Пожертвовать

source: Settings
ru: Настройки

# searchEnterName
source: Enter a name
ru: Введите название

# sortByPeers
source: By Peers
ru: По раздающим

# sortBySize
source: By Size
ru: По размеру

# sortByDate
source: By Date
ru: По дате

# sortTooltipDesc
source: From largest to smallest
ru: От большего к меньшему

# sortTooltipAsc
source: From smallest to largest
ru: От меньшего к большему

# filterQuality
source: Quality
ru: Качество

# filterVoice
source: Voice
ru: Озвучка

# filterSeasons
source: Seasons
ru: Сезоны

# filterTracker
source: Tracker
ru: Трекер

# noResultsFound
source: By query "{query}" not found.
ru: По запросу «{query}» ничего не найдено.

source: Torrents: {count}
ru: Торрентов: {count}

source: Download TorrServer
ru: Скачать TorrServer

# downloadAwaiting
source: Awaiting...
ru: Ожидание...

# downloadStarting
source: Download file from: {filename}
ru: Скачивание файла: {filename}

# downloadProgress
source: Downloaded: {percent}% {received} / {total}
ru: Скачано: {percent}% {received} / {total}

# downloadPreparing
source: Prepare file...
ru: Подготовка файла...

source: Download complete: {path}
ru: Загрузка завершена: {path}

source: Download complete.
ru: Загрузка завершена.

# downloadCompleteErrorPerm
source: Download complete. Error set exec permission.
ru: Загрузка завершена. Ошибка установки прав на выполнение.

# downloadCompleteErrorQuarantine
source: Download complete. Error remove quarantine attribute.
ru: Загрузка завершена. Ошибка снятия карантина.

# downloadErrorPlatform
source: Download only in desktop OS.
ru: Загрузка доступна только в десктопных ОС.

# downloadErrorUnknownPlatform
source: Error: unknown platform.
ru: Ошибка: неизвестная платформа.

# downloadErrorConnect
source: Error connect to host: {code}
ru: Ошибка подключения к хосту: {code}

# downloadError
source: Error download: {error}
ru: Ошибка загрузки: {error}

source: Download canceled.
ru: Загрузка отменена.

# buttonCancel
source: Cancel
ru: Отмена

# buttonClose
source: Close
ru: Закрыть

# settingsTitle
source: Settings
ru: Настройки

# tsAddressLabel
source: Address of TorrServer (http://<host>:<port>)
ru: Адрес TorrServer (http://<хост>:<порт>)

# tsAuthLabel
source: Auth of TorrServer (username:password)
ru: Авторизация TorrServer (логин:пароль)

# tsAuthHint
source: username:password
ru: логин:пароль

# selectPlayerLabel
source: Select a player
ru: Выберите плеер

# selectPlayerHint
source: vlc, mpv, etc...
ru: vlc, mpv и др...

# rememberSearchParams
source: Remember search parameters
ru: Запоминать параметры поиска

# saveSettings
source: Save
ru: Сохранить

source: Settings saved!
ru: Настройки сохранены!

# downloadTorrServerButton
source: Download TorrServer
ru: Скачать TorrServer

# startTorrServerButton
source: Start TorrServer
ru: Запустить TorrServer

# stopTorrServerButton
source: Stop TorrServer
ru: Остановить TorrServer

source: TorrsTV Loading...
ru: TorrsTV загружается...

# torrstvError
source: TorrsTV Error: {error}
ru: TorrsTV ошибка: {error}

# torrentInfoTitle
source: Torrent Information
ru: Информация о торренте

source: Loading...
ru: Загрузка...

# errorLabel
source: Error: {error}
ru: Ошибка: {error}

# retryButton
source: Retry
ru: Повторить

# hashLabel
source: Hash
ru: Хеш

# sizeLabel
source: Size
ru: Размер

# statusLabel
source: Status
ru: Статус

# seedersLabel
source: Seeders
ru: Раздающие

# speedLabel
source: Speed
ru: Скорость

# preloadLabel
source: Preload
ru: Предзагрузка

# filesTitle
source: Files ({count})
ru: Файлы ({count})

# continueButton
source: Continue Play
ru: Продолжить воспроизведение

# clearViewedButton
source: Clear Viewed
ru: Очистить просмотренные

source: Unknown file
ru: Неизвестный файл

# torrentStatusUnknown
source: Unknown
ru: Неизвестен

source: Internal error
ru: Внутренняя ошибка

# torrentStatusAdded
source: Torrent added
ru: Торрент добавлен

# torrentStatusGettingInfo
source: Torrent getting info
ru: Получение информации о торренте

# torrentStatusPreload
source: Torrent preload
ru: Предзагрузка торрента

# torrentStatusWorking
source: Torrent working
ru: Торрент работает

# torrentStatusClosed
source: Torrent closed
ru: Торрент закрыт

# torrentStatusInDb
source: Torrent in db
ru: Торрент в базе

source: Empty list
ru: Список пуст

# torrServerSettingsTitle
source: TorrServer Settings
ru: Настройки TorrServer

source: Loading settings...
ru: Загрузка настроек...

# torrServerVersion
source: TorrServer version: {version}, {host}
ru: Версия TorrServer: {version}, {host}

# settingsSavedSuccess
source: Settings saved successfully
ru: Настройки успешно сохранены

# settingsSavedError
source: Failed to save settings
ru: Не удалось сохранить настройки

# sendSettingsButton
source: Send settings
ru: Отправить настройки

# tsCacheSizeLabel
source: Cache size
ru: Размер кэша

# tsCacheSizeHint
source: Cache size in bytes (minimum 32MB)
ru: Размер кэша в байтах (минимум 32 МБ)

# tsReaderReadAheadLabel
source: Read-ahead
ru: Упреждающее чтение

# tsReaderReadAheadHint
source: Read-ahead buffer percentage
ru: Процент буфера упреждающего чтения

# tsPreloadCacheLabel
source: Preload cache size
ru: Размер предзагрузки

# tsPreloadCacheHint
source: Preload cache size
ru: Размер кэша предзагрузки

# tsRetrackersModeLabel
source: Retrackers mode
ru: Режим ретрекеров

# tsRetrackersModeHint
source: Retrackers operation mode
ru: Режим работы с ретрекерами

# tsTorrentDisconnectTimeoutLabel
source: Torrent disconnect timeout
ru: Таймаут отключения торрента

# tsTorrentDisconnectTimeoutHint
source: Timeout in seconds
ru: Таймаут в секундах

# tsDownloadRateLimitLabel
source: Download rate limit
ru: Лимит загрузки

# tsDownloadRateLimitHint
source: Download speed limit in KB/s (0 - unlimited)
ru: Ограничение скорости загрузки в КБ/с (0 — без лимита)

# tsUploadRateLimitLabel
source: Upload rate limit
ru: Лимит отдачи

# tsUploadRateLimitHint
source: Upload speed limit in KB/s (0 - unlimited)
ru: Ограничение скорости отдачи в КБ/с (0 — без лимита)

# tsConnectionsLimitLabel
source: Connections limit
ru: Лимит соединений

# tsConnectionsLimitHint
source: Maximum number of connections
ru: Максимальное количество соединений

# tsPeersListenPortLabel
source: P2P port
ru: P2P порт

# tsPeersListenPortHint
source: P2P listen port (0 - random)
ru: Порт для P2P-соединений (0 — случайный)

# tsSslPortLabel
source: SSL port
ru: SSL порт

# tsSslPortHint
source: SSL connection port
ru: Порт для SSL-соединений

# tsTorrentsSavePathLabel
source: Cache storage path
ru: Путь хранения кэша

# tsTorrentsSavePathHint
source: Path where cache will be stored
ru: Путь, где будет сохранён кэш

# tsFriendlyNameLabel
source: DLNA name
ru: Имя DLNA

# tsFriendlyNameHint
source: Server name for DLNA
ru: Имя сервера для DLNA

# tsSslCertLabel
source: SSL certificate
ru: SSL-сертификат

# tsSslCertHint
source: Path to certificate file
ru: Путь к файлу сертификата

# tsSslKeyLabel
source: SSL key
ru: SSL-ключ

# tsSslKeyHint
source: Path to key file
ru: Путь к файлу ключа

# tsUseDiskLabel
source: Use disk for cache
ru: Использовать диск для кэша

# tsUseDiskHint
source: Write cache to disk (slower but saves memory)
ru: Записывать кэш на диск (медленнее, но экономит память)

# tsRemoveCacheOnDropLabel
source: Remove cache on torrent delete
ru: Удалять кэш при удалении торрента

# tsRemoveCacheOnDropHint
source: Delete data when torrent is removed
ru: Удалять данные при удалении торрента

# tsForceEncryptLabel
source: Force encryption
ru: Принудительное шифрование

# tsForceEncryptHint
source: Use encrypted headers
ru: Использовать зашифрованные заголовки

# tsEnableDebugLabel
source: Enable debug log
ru: Включить отладочный лог

# tsEnableDebugHint
source: Write detailed logs
ru: Записывать подробные логи

# tsEnableDLNALabel
source: Enable DLNA
ru: Включить DLNA

# tsEnableDLNAHint
source: Activate DLNA server
ru: Активировать DLNA-сервер

# tsEnableRutorSearchLabel
source: Enable Rutor search
ru: Включить поиск Rutor

# tsEnableRutorSearchHint
source: Enable built-in search
ru: Включить встроенный поиск

# tsEnableIPv6Label
source: Enable IPv6
ru: Включить IPv6

# tsEnableIPv6Hint
source: Allow IPv6
ru: Разрешить IPv6

# tsDisableTCPLabel
source: Disable TCP
ru: Отключить TCP

# tsDisableTCPHint
source: Use UTP only
ru: Использовать только UTP

# tsDisableUTPLabel
source: Disable UTP
ru: Отключить UTP

# tsDisableUTPHint
source: Use TCP only
ru: Использовать только TCP

# tsDisableUPNPLabel
source: Disable UPnP
ru: Отключить UPnP

# tsDisableUPNPHint
source: Disable automatic port forwarding
ru: Отключить автоматическую настройку портов

# tsDisableDHTLabel
source: Disable DHT
ru: Отключить DHT

# tsDisableDHTHint
source: Disable DHT
ru: Отключить DHT

# tsDisablePEXLabel
source: Disable PEX
ru: Отключить PEX

# tsDisablePEXHint
source: Disable PEX
ru: Отключить PEX

# tsDisableUploadLabel
source: Disable upload
ru: Отключить отдачу

# tsDisableUploadHint
source: Disable uploading to peers
ru: Запретить отдачу пиров

# tsResponsiveModeLabel
source: Enable fast read mode
ru: Быстрый режим чтения

# tsResponsiveModeHint
source: Fast torrent reading mode
ru: Быстрый режим чтения торрента

# playerSettingsTitle
source: Player Settings
ru: Настройки плеера

# audioFiltersSection
source: Audio filters
ru: Аудиофильтры

source: Enable audio filters
ru: Включить аудиофильтры

# panVolumeSection
source: Panorama Volume
ru: Панорамирование звука

source: Front Pan Volume
ru: Громкость передних колонок

# centerPanVolume
source: Center Pan Volume (voice)
ru: Громкость центральной колонки (голос)

# surroundPanVolume
source: Surround Pan Volume (side speakers, 7.1 only)
ru: Громкость боковых колонок (только 7.1)

source: Rear Pan Volume
ru: Громкость задних колонок

# audioEffectsSection
source: Audio effects
ru: Аудиоэффекты

# normalize
source: Normalize (volume normalization)
ru: Нормализация (выравнивание громкости)

# smoothing
source: Smoothing (peak smoothing)
ru: Сглаживание (подавление пиков)

# stereoTo51
source: Stereo to 5.1 (split stereo into 5.1 channels)
ru: Stereo → 5.1 (разделить стерео на 5.1 каналов)

# sevenOneTo51
source: 7.1 to 5.1 (convert 7.1 to 5.1 channels)
ru: 7.1 → 5.1 (преобразовать 7.1 в 5.1 каналы)

# playerSettingsButton
source: Settings
ru: Настройки

# audioTracksButton
source: Audio tracks
ru: Аудиодорожки

# subtitleTracksButton
source: Subtitles
ru: Субтитры

# audioTracksTitle
source: Audio tracks
ru: Аудиодорожки

# subtitlesTitle
source: Subtitles
ru: Субтитры

# disableSubtitles
source: Disable
ru: Отключить

# unknownAudio
source: Audio {id}
ru: Аудио {id}

# unknownSubtitles
source: Subtitles {id}
ru: Субтитры {id}

source: mono
ru: моно

source: stereo
ru: стерео

# buffering
source: Buffering: {percentage}%
ru: Буферизация: {percentage}%
